balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA310.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU3" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PUE" edc:desc="" edc:mask="0x1" edc:name="CN32PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN33PUE" edc:desc="" edc:mask="0x1" edc:name="CN33PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN34PUE" edc:desc="" edc:mask="0x1" edc:name="CN34PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN35PUE" edc:desc="" edc:mask="0x1" edc:name="CN35PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN36PUE" edc:desc="" edc:mask="0x1" edc:name="CN36PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN37PUE" edc:desc="" edc:mask="0x1" edc:name="CN37PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN38PUE" edc:desc="" edc:mask="0x1" edc:name="CN38PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN39PUE" edc:desc="" edc:mask="0x1" edc:name="CN39PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN40PUE" edc:desc="" edc:mask="0x1" edc:name="CN40PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN41PUE" edc:desc="" edc:mask="0x1" edc:name="CN41PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN42PUE" edc:desc="" edc:mask="0x1" edc:name="CN42PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN43PUE" edc:desc="" edc:mask="0x1" edc:name="CN43PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN44PUE" edc:desc="" edc:mask="0x1" edc:name="CN44PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN45PUE" edc:desc="" edc:mask="0x1" edc:name="CN45PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN46PUE" edc:desc="" edc:mask="0x1" edc:name="CN46PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN47PUE" edc:desc="" edc:mask="0x1" edc:name="CN47PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN48PUE" edc:desc="" edc:mask="0x1" edc:name="CN48PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN49PUE" edc:desc="" edc:mask="0x1" edc:name="CN49PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PUE" edc:desc="" edc:mask="0x1" edc:name="CN50PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PUE" edc:desc="" edc:mask="0x1" edc:name="CN51PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PUE" edc:desc="" edc:mask="0x1" edc:name="CN52PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PUE" edc:desc="" edc:mask="0x1" edc:name="CN53PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PUE" edc:desc="" edc:mask="0x1" edc:name="CN54PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PUE" edc:desc="" edc:mask="0x1" edc:name="CN55PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PUE" edc:desc="" edc:mask="0x1" edc:name="CN56PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57PUE" edc:desc="" edc:mask="0x1" edc:name="CN57PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58PUE" edc:desc="" edc:mask="0x1" edc:name="CN58PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PUE" edc:desc="" edc:mask="0x1" edc:name="CN59PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PUE" edc:desc="" edc:mask="0x1" edc:name="CN60PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PUE" edc:desc="" edc:mask="0x1" edc:name="CN61PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PUE" edc:desc="" edc:mask="0x1" edc:name="CN62PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PUE" edc:desc="" edc:mask="0x1" edc:name="CN63PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU5" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PUE" edc:desc="" edc:mask="0x1" edc:name="CN64PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PUE" edc:desc="" edc:mask="0x1" edc:name="CN65PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN66PUE" edc:desc="" edc:mask="0x1" edc:name="CN66PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN67PUE" edc:desc="" edc:mask="0x1" edc:name="CN67PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN68PUE" edc:desc="" edc:mask="0x1" edc:name="CN68PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PUE" edc:desc="" edc:mask="0x1" edc:name="CN69PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PUE" edc:desc="" edc:mask="0x1" edc:name="CN70PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PUE" edc:desc="" edc:mask="0x1" edc:name="CN71PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72PUE" edc:desc="" edc:mask="0x1" edc:name="CN72PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN73PUE" edc:desc="" edc:mask="0x1" edc:name="CN73PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN74PUE" edc:desc="" edc:mask="0x1" edc:name="CN74PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN75PUE" edc:desc="" edc:mask="0x1" edc:name="CN75PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN76PUE" edc:desc="" edc:mask="0x1" edc:name="CN76PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN77PUE" edc:desc="" edc:mask="0x1" edc:name="CN77PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN78PUE" edc:desc="" edc:mask="0x1" edc:name="CN78PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN79PUE" edc:desc="" edc:mask="0x1" edc:name="CN79PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="CNPU6" edc:desc="" edc:impl="0xff7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000" edc:name="CNPU6" edc:nzwidth="0x10" edc:por="-----------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN80PUE" edc:desc="" edc:mask="0x1" edc:name="CN80PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN81PUE" edc:desc="" edc:mask="0x1" edc:name="CN81PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN82PUE" edc:desc="" edc:mask="0x1" edc:name="CN82PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN83PUE" edc:desc="" edc:mask="0x1" edc:name="CN83PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN84PUE" edc:desc="" edc:mask="0x1" edc:name="CN84PUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="n----------nnnn-" edc:cname="INTCON1" edc:desc="" edc:impl="0x805e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----------0000-" edc:name="INTCON1" edc:nzwidth="0x10" edc:por="0----------0000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OSCFAIL" edc:desc="" edc:mask="0x1" edc:name="OSCFAIL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKERR" edc:desc="" edc:mask="0x1" edc:name="STKERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDRERR" edc:desc="" edc:mask="0x1" edc:name="ADDRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MATHERR" edc:desc="" edc:mask="0x1" edc:name="MATHERR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NSTDIS" edc:desc="" edc:mask="0x1" edc:name="NSTDIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr---------nnnnn" edc:cname="INTCON2" edc:desc="" edc:impl="0xc01f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---------00000" edc:name="INTCON2" edc:nzwidth="0x10" edc:por="00---------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="DISI" edc:desc="" edc:mask="0x1" edc:name="DISI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ALTIVT" edc:desc="" edc:mask="0x1" edc:name="ALTIVT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000" edc:name="IFS0" edc:nzwidth="0x10" edc:por="-000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF1IF" edc:desc="" edc:mask="0x1" edc:name="SPF1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:desc="" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn-n-nnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xff5f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000-0-00000" edc:name="IFS1" edc:nzwidth="0x10" edc:por="00000000-0-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C1IF" edc:desc="" edc:mask="0x1" edc:name="SI2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C1IF" edc:desc="" edc:mask="0x1" edc:name="MI2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMIF" edc:desc="" edc:mask="0x1" edc:name="CMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNIF" edc:desc="" edc:mask="0x1" edc:name="CNIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC7IF" edc:desc="" edc:mask="0x1" edc:name="IC7IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
