balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA310.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA22" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA22" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C5" edc:desc="" edc:mask="0x1" edc:name="S32C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C5" edc:desc="" edc:mask="0x1" edc:name="S33C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C5" edc:desc="" edc:mask="0x1" edc:name="S34C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C5" edc:desc="" edc:mask="0x1" edc:name="S35C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C5" edc:desc="" edc:mask="0x1" edc:name="S36C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C5" edc:desc="" edc:mask="0x1" edc:name="S37C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C5" edc:desc="" edc:mask="0x1" edc:name="S38C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C5" edc:desc="" edc:mask="0x1" edc:name="S39C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C5" edc:desc="" edc:mask="0x1" edc:name="S40C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C5" edc:desc="" edc:mask="0x1" edc:name="S41C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C5" edc:desc="" edc:mask="0x1" edc:name="S42C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C5" edc:desc="" edc:mask="0x1" edc:name="S43C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C5" edc:desc="" edc:mask="0x1" edc:name="S44C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C5" edc:desc="" edc:mask="0x1" edc:name="S45C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C5" edc:desc="" edc:mask="0x1" edc:name="S46C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C5" edc:desc="" edc:mask="0x1" edc:name="S47C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA23" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA23" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C5" edc:desc="" edc:mask="0x1" edc:name="S48C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S49C5" edc:desc="" edc:mask="0x1" edc:name="S49C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S50C5" edc:desc="" edc:mask="0x1" edc:name="S50C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S51C5" edc:desc="" edc:mask="0x1" edc:name="S51C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S52C5" edc:desc="" edc:mask="0x1" edc:name="S52C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S53C5" edc:desc="" edc:mask="0x1" edc:name="S53C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S54C5" edc:desc="" edc:mask="0x1" edc:name="S54C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S55C5" edc:desc="" edc:mask="0x1" edc:name="S55C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S56C5" edc:desc="" edc:mask="0x1" edc:name="S56C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S57C5" edc:desc="" edc:mask="0x1" edc:name="S57C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S58C5" edc:desc="" edc:mask="0x1" edc:name="S58C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S59C5" edc:desc="" edc:mask="0x1" edc:name="S59C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S60C5" edc:desc="" edc:mask="0x1" edc:name="S60C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S61C5" edc:desc="" edc:mask="0x1" edc:name="S61C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S62C5" edc:desc="" edc:mask="0x1" edc:name="S62C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S63C5" edc:desc="" edc:mask="0x1" edc:name="S63C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA24" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA24" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C6" edc:desc="" edc:mask="0x1" edc:name="S00C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C6" edc:desc="" edc:mask="0x1" edc:name="S01C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C6" edc:desc="" edc:mask="0x1" edc:name="S02C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C6" edc:desc="" edc:mask="0x1" edc:name="S03C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C6" edc:desc="" edc:mask="0x1" edc:name="S04C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C6" edc:desc="" edc:mask="0x1" edc:name="S05C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C6" edc:desc="" edc:mask="0x1" edc:name="S06C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C6" edc:desc="" edc:mask="0x1" edc:name="S07C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C6" edc:desc="" edc:mask="0x1" edc:name="S08C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C6" edc:desc="" edc:mask="0x1" edc:name="S09C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C6" edc:desc="" edc:mask="0x1" edc:name="S10C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C6" edc:desc="" edc:mask="0x1" edc:name="S11C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C6" edc:desc="" edc:mask="0x1" edc:name="S12C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C6" edc:desc="" edc:mask="0x1" edc:name="S13C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C6" edc:desc="" edc:mask="0x1" edc:name="S14C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C6" edc:desc="" edc:mask="0x1" edc:name="S15C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
