balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA310.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR2" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x3f" edc:name="RP4R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP5R" edc:desc="" edc:mask="0x3f" edc:name="RP5R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP4R0" edc:desc="" edc:mask="0x1" edc:name="RP4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R1" edc:desc="" edc:mask="0x1" edc:name="RP4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R2" edc:desc="" edc:mask="0x1" edc:name="RP4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R3" edc:desc="" edc:mask="0x1" edc:name="RP4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R4" edc:desc="" edc:mask="0x1" edc:name="RP4R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R5" edc:desc="" edc:mask="0x1" edc:name="RP4R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP5R0" edc:desc="" edc:mask="0x1" edc:name="RP5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R1" edc:desc="" edc:mask="0x1" edc:name="RP5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R2" edc:desc="" edc:mask="0x1" edc:name="RP5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R3" edc:desc="" edc:mask="0x1" edc:name="RP5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R4" edc:desc="" edc:mask="0x1" edc:name="RP5R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R5" edc:desc="" edc:mask="0x1" edc:name="RP5R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR3" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR3" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP6R" edc:desc="" edc:mask="0x3f" edc:name="RP6R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0x3f" edc:name="RP7R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP6R0" edc:desc="" edc:mask="0x1" edc:name="RP6R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R1" edc:desc="" edc:mask="0x1" edc:name="RP6R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R2" edc:desc="" edc:mask="0x1" edc:name="RP6R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R3" edc:desc="" edc:mask="0x1" edc:name="RP6R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R4" edc:desc="" edc:mask="0x1" edc:name="RP6R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R5" edc:desc="" edc:mask="0x1" edc:name="RP6R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP7R0" edc:desc="" edc:mask="0x1" edc:name="RP7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R1" edc:desc="" edc:mask="0x1" edc:name="RP7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R2" edc:desc="" edc:mask="0x1" edc:name="RP7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R3" edc:desc="" edc:mask="0x1" edc:name="RP7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R4" edc:desc="" edc:mask="0x1" edc:name="RP7R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R5" edc:desc="" edc:mask="0x1" edc:name="RP7R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR4" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP8R" edc:desc="" edc:mask="0x3f" edc:name="RP8R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP9R" edc:desc="" edc:mask="0x3f" edc:name="RP9R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP8R0" edc:desc="" edc:mask="0x1" edc:name="RP8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R1" edc:desc="" edc:mask="0x1" edc:name="RP8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R2" edc:desc="" edc:mask="0x1" edc:name="RP8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R3" edc:desc="" edc:mask="0x1" edc:name="RP8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R4" edc:desc="" edc:mask="0x1" edc:name="RP8R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R5" edc:desc="" edc:mask="0x1" edc:name="RP8R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP9R0" edc:desc="" edc:mask="0x1" edc:name="RP9R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R1" edc:desc="" edc:mask="0x1" edc:name="RP9R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R2" edc:desc="" edc:mask="0x1" edc:name="RP9R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R3" edc:desc="" edc:mask="0x1" edc:name="RP9R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R4" edc:desc="" edc:mask="0x1" edc:name="RP9R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R5" edc:desc="" edc:mask="0x1" edc:name="RP9R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR5" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR5" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP10R" edc:desc="" edc:mask="0x3f" edc:name="RP10R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP11R" edc:desc="" edc:mask="0x3f" edc:name="RP11R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP10R0" edc:desc="" edc:mask="0x1" edc:name="RP10R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R1" edc:desc="" edc:mask="0x1" edc:name="RP10R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R2" edc:desc="" edc:mask="0x1" edc:name="RP10R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R3" edc:desc="" edc:mask="0x1" edc:name="RP10R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R4" edc:desc="" edc:mask="0x1" edc:name="RP10R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R5" edc:desc="" edc:mask="0x1" edc:name="RP10R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP11R0" edc:desc="" edc:mask="0x1" edc:name="RP11R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R1" edc:desc="" edc:mask="0x1" edc:name="RP11R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R2" edc:desc="" edc:mask="0x1" edc:name="RP11R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R3" edc:desc="" edc:mask="0x1" edc:name="RP11R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R4" edc:desc="" edc:mask="0x1" edc:name="RP11R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R5" edc:desc="" edc:mask="0x1" edc:name="RP11R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
